hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gpiof.h
#define	GPIOF_OTYPER_OT15_B_0X0				(0x0u<<15)
#define	GPIOF_OTYPER_OT15_B_0X1				(0x1u<<15)
#define	GPIOF_OTYPER_OT14_B_0X0				(0x0u<<14)
#define	GPIOF_OTYPER_OT14_B_0X1				(0x1u<<14)
#define	GPIOF_OTYPER_OT13_B_0X0				(0x0u<<13)
#define	GPIOF_OTYPER_OT13_B_0X1				(0x1u<<13)
#define	GPIOF_OTYPER_OT12_B_0X0				(0x0u<<12)
#define	GPIOF_OTYPER_OT12_B_0X1				(0x1u<<12)
#define	GPIOF_OTYPER_OT11_B_0X0				(0x0u<<11)
#define	GPIOF_OTYPER_OT11_B_0X1				(0x1u<<11)
#define	GPIOF_OTYPER_OT10_B_0X0				(0x0u<<10)
#define	GPIOF_OTYPER_OT10_B_0X1				(0x1u<<10)
#define	GPIOF_OTYPER_OT9_B_0X0				(0x0u<<9)
#define	GPIOF_OTYPER_OT9_B_0X1				(0x1u<<9)
#define	GPIOF_OTYPER_OT8_B_0X0				(0x0u<<8)
#define	GPIOF_OTYPER_OT8_B_0X1				(0x1u<<8)
#define	GPIOF_OTYPER_OT7_B_0X0				(0x0u<<7)
#define	GPIOF_OTYPER_OT7_B_0X1				(0x1u<<7)
#define	GPIOF_OTYPER_OT6_B_0X0				(0x0u<<6)
#define	GPIOF_OTYPER_OT6_B_0X1				(0x1u<<6)
#define	GPIOF_OTYPER_OT5_B_0X0				(0x0u<<5)
#define	GPIOF_OTYPER_OT5_B_0X1				(0x1u<<5)
#define	GPIOF_OTYPER_OT4_B_0X0				(0x0u<<4)
#define	GPIOF_OTYPER_OT4_B_0X1				(0x1u<<4)
#define	GPIOF_OTYPER_OT3_B_0X0				(0x0u<<3)
#define	GPIOF_OTYPER_OT3_B_0X1				(0x1u<<3)
#define	GPIOF_OTYPER_OT2_B_0X0				(0x0u<<2)
#define	GPIOF_OTYPER_OT2_B_0X1				(0x1u<<2)
#define	GPIOF_OTYPER_OT1_B_0X0				(0x0u<<1)
#define	GPIOF_OTYPER_OT1_B_0X1				(0x1u<<1)
#define	GPIOF_OTYPER_OT0_B_0X0				(0x0u<<0)
#define	GPIOF_OTYPER_OT0_B_0X1				(0x1u<<0)

// OSPEEDR Configuration

#define	GPIOF_OSPEEDR_OSPEED15				(0x3u<<30)
#define	GPIOF_OSPEEDR_OSPEED15_0			(0x1u<<30)
#define	GPIOF_OSPEEDR_OSPEED14				(0x3u<<28)
#define	GPIOF_OSPEEDR_OSPEED14_0			(0x1u<<28)
#define	GPIOF_OSPEEDR_OSPEED13				(0x3u<<26)
#define	GPIOF_OSPEEDR_OSPEED13_0			(0x1u<<26)
#define	GPIOF_OSPEEDR_OSPEED12				(0x3u<<24)
#define	GPIOF_OSPEEDR_OSPEED12_0			(0x1u<<24)
#define	GPIOF_OSPEEDR_OSPEED11				(0x3u<<22)
#define	GPIOF_OSPEEDR_OSPEED11_0			(0x1u<<22)
#define	GPIOF_OSPEEDR_OSPEED10				(0x3u<<20)
#define	GPIOF_OSPEEDR_OSPEED10_0			(0x1u<<20)
#define	GPIOF_OSPEEDR_OSPEED9				(0x3u<<18)
#define	GPIOF_OSPEEDR_OSPEED9_0				(0x1u<<18)
#define	GPIOF_OSPEEDR_OSPEED8				(0x3u<<16)
#define	GPIOF_OSPEEDR_OSPEED8_0				(0x1u<<16)
#define	GPIOF_OSPEEDR_OSPEED7				(0x3u<<14)
#define	GPIOF_OSPEEDR_OSPEED7_0				(0x1u<<14)
#define	GPIOF_OSPEEDR_OSPEED6				(0x3u<<12)
#define	GPIOF_OSPEEDR_OSPEED6_0				(0x1u<<12)
#define	GPIOF_OSPEEDR_OSPEED5				(0x3u<<10)
#define	GPIOF_OSPEEDR_OSPEED5_0				(0x1u<<10)
#define	GPIOF_OSPEEDR_OSPEED4				(0x3u<<8)
#define	GPIOF_OSPEEDR_OSPEED4_0				(0x1u<<8)
#define	GPIOF_OSPEEDR_OSPEED3				(0x3u<<6)
#define	GPIOF_OSPEEDR_OSPEED3_0				(0x1u<<6)
#define	GPIOF_OSPEEDR_OSPEED2				(0x3u<<4)
#define	GPIOF_OSPEEDR_OSPEED2_0				(0x1u<<4)
#define	GPIOF_OSPEEDR_OSPEED1				(0x3u<<2)
#define	GPIOF_OSPEEDR_OSPEED1_0				(0x1u<<2)
#define	GPIOF_OSPEEDR_OSPEED0				(0x3u<<0)
#define	GPIOF_OSPEEDR_OSPEED0_0				(0x1u<<0)

#define	GPIOF_OSPEEDR_OSPEED15_B_0X0		(0x0u<<30)
#define	GPIOF_OSPEEDR_OSPEED15_B_0X1		(0x1u<<30)
#define	GPIOF_OSPEEDR_OSPEED15_B_0X2		(0x2u<<30)
#define	GPIOF_OSPEEDR_OSPEED15_B_0X3		(0x3u<<30)
#define	GPIOF_OSPEEDR_OSPEED14_B_0X0		(0x0u<<28)
#define	GPIOF_OSPEEDR_OSPEED14_B_0X1		(0x1u<<28)
#define	GPIOF_OSPEEDR_OSPEED14_B_0X2		(0x2u<<28)
#define	GPIOF_OSPEEDR_OSPEED14_B_0X3		(0x3u<<28)
#define	GPIOF_OSPEEDR_OSPEED13_B_0X0		(0x0u<<26)
#define	GPIOF_OSPEEDR_OSPEED13_B_0X1		(0x1u<<26)
#define	GPIOF_OSPEEDR_OSPEED13_B_0X2		(0x2u<<26)
#define	GPIOF_OSPEEDR_OSPEED13_B_0X3		(0x3u<<26)
#define	GPIOF_OSPEEDR_OSPEED12_B_0X0		(0x0u<<24)
#define	GPIOF_OSPEEDR_OSPEED12_B_0X1		(0x1u<<24)
#define	GPIOF_OSPEEDR_OSPEED12_B_0X2		(0x2u<<24)
#define	GPIOF_OSPEEDR_OSPEED12_B_0X3		(0x3u<<24)
#define	GPIOF_OSPEEDR_OSPEED11_B_0X0		(0x0u<<22)
#define	GPIOF_OSPEEDR_OSPEED11_B_0X1		(0x1u<<22)
#define	GPIOF_OSPEEDR_OSPEED11_B_0X2		(0x2u<<22)
#define	GPIOF_OSPEEDR_OSPEED11_B_0X3		(0x3u<<22)
#define	GPIOF_OSPEEDR_OSPEED10_B_0X0		(0x0u<<20)
#define	GPIOF_OSPEEDR_OSPEED10_B_0X1		(0x1u<<20)
#define	GPIOF_OSPEEDR_OSPEED10_B_0X2		(0x2u<<20)
#define	GPIOF_OSPEEDR_OSPEED10_B_0X3		(0x3u<<20)
#define	GPIOF_OSPEEDR_OSPEED9_B_0X0			(0x0u<<18)
#define	GPIOF_OSPEEDR_OSPEED9_B_0X1			(0x1u<<18)
#define	GPIOF_OSPEEDR_OSPEED9_B_0X2			(0x2u<<18)
#define	GPIOF_OSPEEDR_OSPEED9_B_0X3			(0x3u<<18)
#define	GPIOF_OSPEEDR_OSPEED8_B_0X0			(0x0u<<16)
#define	GPIOF_OSPEEDR_OSPEED8_B_0X1			(0x1u<<16)
#define	GPIOF_OSPEEDR_OSPEED8_B_0X2			(0x2u<<16)
#define	GPIOF_OSPEEDR_OSPEED8_B_0X3			(0x3u<<16)
#define	GPIOF_OSPEEDR_OSPEED7_B_0X0			(0x0u<<14)
#define	GPIOF_OSPEEDR_OSPEED7_B_0X1			(0x1u<<14)
#define	GPIOF_OSPEEDR_OSPEED7_B_0X2			(0x2u<<14)
#define	GPIOF_OSPEEDR_OSPEED7_B_0X3			(0x3u<<14)
#define	GPIOF_OSPEEDR_OSPEED6_B_0X0			(0x0u<<12)
#define	GPIOF_OSPEEDR_OSPEED6_B_0X1			(0x1u<<12)
#define	GPIOF_OSPEEDR_OSPEED6_B_0X2			(0x2u<<12)
#define	GPIOF_OSPEEDR_OSPEED6_B_0X3			(0x3u<<12)
#define	GPIOF_OSPEEDR_OSPEED5_B_0X0			(0x0u<<10)
#define	GPIOF_OSPEEDR_OSPEED5_B_0X1			(0x1u<<10)
#define	GPIOF_OSPEEDR_OSPEED5_B_0X2			(0x2u<<10)
#define	GPIOF_OSPEEDR_OSPEED5_B_0X3			(0x3u<<10)
#define	GPIOF_OSPEEDR_OSPEED4_B_0X0			(0x0u<<8)
#define	GPIOF_OSPEEDR_OSPEED4_B_0X1			(0x1u<<8)
#define	GPIOF_OSPEEDR_OSPEED4_B_0X2			(0x2u<<8)
#define	GPIOF_OSPEEDR_OSPEED4_B_0X3			(0x3u<<8)
#define	GPIOF_OSPEEDR_OSPEED3_B_0X0			(0x0u<<6)
#define	GPIOF_OSPEEDR_OSPEED3_B_0X1			(0x1u<<6)
#define	GPIOF_OSPEEDR_OSPEED3_B_0X2			(0x2u<<6)
#define	GPIOF_OSPEEDR_OSPEED3_B_0X3			(0x3u<<6)
#define	GPIOF_OSPEEDR_OSPEED2_B_0X0			(0x0u<<4)
#define	GPIOF_OSPEEDR_OSPEED2_B_0X1			(0x1u<<4)
#define	GPIOF_OSPEEDR_OSPEED2_B_0X2			(0x2u<<4)
#define	GPIOF_OSPEEDR_OSPEED2_B_0X3			(0x3u<<4)
#define	GPIOF_OSPEEDR_OSPEED1_B_0X0			(0x0u<<2)
#define	GPIOF_OSPEEDR_OSPEED1_B_0X1			(0x1u<<2)
#define	GPIOF_OSPEEDR_OSPEED1_B_0X2			(0x2u<<2)
#define	GPIOF_OSPEEDR_OSPEED1_B_0X3			(0x3u<<2)
#define	GPIOF_OSPEEDR_OSPEED0_B_0X0			(0x0u<<0)
#define	GPIOF_OSPEEDR_OSPEED0_B_0X1			(0x1u<<0)
#define	GPIOF_OSPEEDR_OSPEED0_B_0X2			(0x2u<<0)
#define	GPIOF_OSPEEDR_OSPEED0_B_0X3			(0x3u<<0)

